

// console.log(nameList);



(() => {
    const nameList = [

        "צאירי דוד בן ישראל",
        "צאירי סעידה בת אברהם",
        "צאירי מרגלית דוד בן דוד",
        "צאירי שלמה בן דוד",
        "מרגלית יוסף בן דוד",
        "מרגלית לאה בת שלום ",
        "צאירי יוסף בן ישראל",
        "צאירי סעידה בת רצון",
        "צאירי מרגלית ישראל בן יוסף",
        "צאירי זכריה בן ישראל",
        "צאירי שולמית בת אברהם ",
        "צאירי סעדיה בן זכריה",
        "צאירי מרגלית רבקה לאה בת זכריה",
        "צאירי מנצור אסתר בת זכריה",
        "צאירי נחמה בת זכריה",
        "צאירי מרגלית יהודה בן דוד",
        "צאירי מרגלית אילה רחל גאזל בת יפת",
        "צאירי מרגלית מרים בת יהודה",
        "צאירי נתן בן יפת",
        "צאירי סעידה לאה בת יששכר",
        "צאירי סעדיה בן נתן",
        "צאירי רחל בת נתן",
        "צאירי נתן בן נתן",
        "צאירי דוד בן נתן",
        "צאירי חממה",
        "צאירי נדאף סעידה בת דוד וחממה",
        "צאירי חנה בת אברהם",
        "צאירי מרגלית אברהם בן דוד",
        "צאירי מרגלית רבקה בת סעדיה",
        "צאירי ישראל בן אברהם",
        "צאירי רחל בת אברהם",
        "מנצור חיים בן מנצור",
        "מנצור שמעה בת יפת",
        "מנצור משה בן חיים",
        "מנצור סלמה בת חיים",
        "מרגלית שרה זוהרה בת נתן",
        "מעודד יפת",
        "מעודה מרים בת מעודד",
        "נדאף שלום סאלם בן יחיא",
        "נדאף מלכה בת שלום",
        "נדאף שרה בת שלום",
        "צעירי יפת בן יוסף",
        "צאירי ישעיהו בן יוסף",
        "צאירי ימימה בת יפת "
    ]

    nameList.sort();        //Sort alphabetically
    nameList.reverse();     

    nameList.forEach(e => {
        let x = `
                <div class="d-flex col-sm-6 col-md-4 justify-content-start">
                    <p class=""> ${e} </p>
                </div>
        `
        document.querySelector('.name-list').insertAdjacentHTML('afterbegin', x);
    });
})();